read_verilog include/rv32i-defines.v verilog/adder.v verilog/cpu.v verilog/mux2to1.v verilog/alu_control.v verilog/if_id.v verilog/alu.v verilog/program_counter.v verilog/branch_decide.v verilog/forwarding_unit.v verilog/branch_predictor.v verilog/imm_gen.v verilog/control_unit.v verilog/instruction_memory.v verilog/data_mem.v verilog/regfile.v verilog/csr_file.v verilog/sign_mask_gen.v verilog/cycle_counter.v verilog/morse_counter.v verilog/morse_encoder.v verilog/morse_fsm.v verilog/toplevel.v

synth_ice40 -noflatten -blif sail.blif

write_json sail.json
