read_verilog baseline_processor/include/rv32i-defines.v baseline_processor/verilog/adder.v baseline_processor/verilog/cpu.v baseline_processor/verilog/mux2to1.v baseline_processor/verilog/alu_control.v baseline_processor/verilog/if_id.v baseline_processor/verilog/alu.v baseline_processor/verilog/program_counter.v baseline_processor/verilog/branch_decide.v baseline_processor/verilog/forwarding_unit.v baseline_processor/verilog/branch_predictor.v baseline_processor/verilog/imm_gen.v baseline_processor/verilog/control_unit.v baseline_processor/verilog/instruction_memory.v baseline_processor/verilog/data_mem.v baseline_processor/verilog/regfile.v baseline_processor/verilog/csr_file.v baseline_processor/verilog/sign_mask_gen.v baseline_processor/verilog/cycle_counter.v baseline_processor/verilog/morse_counter.v baseline_processor/verilog/morse_encoder.v baseline_processor/verilog/morse_fsm.v baseline_processor/verilog/toplevel.v

synth_ice40 -noflatten -blif sail.blif

write_json baseline_processor/sail.json
