read_verilog processor/include/rv32i-defines.v processor/verilog/adder.v processor/verilog/cpu.v processor/verilog/mux2to1.v processor/verilog/alu_control.v processor/verilog/dff.v processor/verilog/alu.v processor/verilog/branch_decide.v processor/verilog/forwarding_unit.v processor/verilog/branch_predictor.v processor/verilog/imm_gen.v processor/verilog/control_unit.v processor/verilog/instruction_memory.v processor/verilog/data_mem.v processor/verilog/regfile.v processor/verilog/sign_mask_gen.v processor/verilog/toplevel.v

synth_ice40 -noflatten -blif sail.blif

write_json processor/sail.json
